IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM14_CONTROLSS_G3_EPWM14.xml
	<register id="CONTROLSS_G3_EPWM14_CAPINTRIPSEL" acronym="CONTROLSS_G3_EPWM14_CAPINTRIPSEL" offset="0x1B0" width="16" description="Event Capture Trip input select">
		<bitfield id="TRIPINPUT15" width="1" begin="14" end="14" resetval="0x0" description="TRIP Input 15   0: Trip Input 15 not selected as combinational ORed input  1: Trip Input 15 selected as combinational ORed input to CAPIN mux" range="14" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT14" width="1" begin="13" end="13" resetval="0x0" description="TRIP Input 14   0: Trip Input 14 not selected as combinational ORed input  1: Trip Input 14 selected as combinational ORed input to CAPIN mux" range="13" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT13" width="1" begin="12" end="12" resetval="0x0" description="TRIP Input 13   0: Trip Input 13 not selected as combinational ORed input  1: Trip Input 13 selected as combinational ORed input to CAPIN mux" range="12" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT12" width="1" begin="11" end="11" resetval="0x0" description="TRIP Input 12   0: Trip Input 12 not selected as combinational ORed input  1: Trip Input 12 selected as combinational ORed input to CAPIN mux" range="11" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT11" width="1" begin="10" end="10" resetval="0x0" description="TRIP Input 11   0: Trip Input 11 not selected as combinational ORed input  1: Trip Input 11 selected as combinational ORed input to CAPIN mux" range="10" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT10" width="1" begin="9" end="9" resetval="0x0" description="TRIP Input 10   0: Trip Input 10 not selected as combinational ORed input  1: Trip Input 10 selected as combinational ORed input to CAPIN mux" range="9" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT9" width="1" begin="8" end="8" resetval="0x0" description="TRIP Input 9   0: Trip Input 9 not selected as combinational ORed input  1: Trip Input 9 selected as combinational ORed input to CAPIN mux" range="8" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT8" width="1" begin="7" end="7" resetval="0x0" description="TRIP Input 8   0: Trip Input 8 not selected as combinational ORed input  1: Trip Input 8 selected as combinational ORed input to CAPIN mux" range="7" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT7" width="1" begin="6" end="6" resetval="0x0" description="TRIP Input 7   0: Trip Input 7 not selected as combinational ORed input  1: Trip Input 7 selected as combinational ORed input to CAPIN mux" range="6" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT6" width="1" begin="5" end="5" resetval="0x0" description="TRIP Input 6   0: Trip Input 6 not selected as combinational ORed input  1: Trip Input 6 selected as combinational ORed input to CAPIN mux" range="5" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT5" width="1" begin="4" end="4" resetval="0x0" description="TRIP Input 5   0: Trip Input 5 not selected as combinational ORed input  1: Trip Input 5 selected as combinational ORed input to CAPIN mux" range="4" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT4" width="1" begin="3" end="3" resetval="0x0" description="TRIP Input 4   0: Trip Input 4 not selected as combinational ORed input  1: Trip Input 4 selected as combinational ORed input to CAPIN mux" range="3" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT3" width="1" begin="2" end="2" resetval="0x0" description="TRIP Input 3   0: Trip Input 3 not selected as combinational ORed input  1: Trip Input 3 selected as combinational ORed input to CAPIN mux" range="2" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT2" width="1" begin="1" end="1" resetval="0x0" description="TRIP Input 2   0: Trip Input 2 not selected as combinational ORed input  1: Trip Input 2 selected as combinational ORed input to CAPIN mux" range="1" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT1" width="1" begin="0" end="0" resetval="0x0" description="TRIP Input 1   0: Trip Input 1 not selected as combinational ORed input  1: Trip Input 1 selected as combinational ORed input to CAPIN mux" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_CAPTRIPSEL" acronym="CONTROLSS_G3_EPWM14_CAPTRIPSEL" offset="0x1B2" width="16" description="Event Capture Signal Select">
		<bitfield id="CAPGATECOMPSEL" width="4" begin="7" end="4" resetval="0x0" description="Digital Compare A Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by CAPGATETRIPSEL register ORed together]" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CAPINCOMPSEL" width="4" begin="3" end="0" resetval="0x0" description="Digital Compare A High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by CAPINTRIPSEL register ORed together]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_SPARE1" acronym="CONTROLSS_G3_EPWM14_SPARE1" offset="0x1EC" width="16" description="Spare1 register">
		<bitfield id="SPARE1_BITS" width="8" begin="7" end="0" resetval="0x0" description="Not used in design currently" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_SPARE2" acronym="CONTROLSS_G3_EPWM14_SPARE2" offset="0x1F0" width="16" description="Spare2 register">
		<bitfield id="SPARE2_BITS" width="8" begin="7" end="0" resetval="0x0" description="Not used in design currently" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_EPWMLOCK" acronym="CONTROLSS_G3_EPWM14_EPWMLOCK" offset="0x1F4" width="32" description="EPWM Lock Register">
		<bitfield id="KEY" width="16" begin="31" end="16" resetval="0x0" description="Write to this register succeeds only if this field is written with a value of 0xa5a5  Note:     [1] Due to this KEY, only 32-bit writes will succeed [provided the KEY matches]. 16-bit writes to the upper or lower half of this register will be ignored" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="DCLOCK" width="1" begin="4" end="4" resetval="0x0" description="0:Digital Compare registers from 0xC0 to 0xD9 offsets are protected by EALLOW. 1: Digital Compare registers from 0xC0 and 0xD9 offsets are locked and not writable." range="4" rwaccess="R/R/WONCE"/> 
		<bitfield id="TZCLRLOCK" width="1" begin="3" end="3" resetval="0x0" description="0:Digital Compare registers from 0x97 to 0x9B offsets are protected by EALLOW. 1: Digital Compare registers from 0x97 and 0x9B offsets are locked and not writable." range="3" rwaccess="R/R/WONCE"/> 
		<bitfield id="TZCFGLOCK" width="1" begin="2" end="2" resetval="0x0" description="0:TripZone registers from 0x80 to 0x8D and TZTRIPOUTSEL at 0x9D offsets are protected by EALLOW. 1: TripZone registers from 0x80 and 0x8D and TZTRIPOUTSEL at 0x9D offsets are locked and not writable." range="2" rwaccess="R/R/WONCE"/> 
		<bitfield id="GLLOCK" width="1" begin="1" end="1" resetval="0x0" description="0:TripZone registers from 0x34 to 0x35 offsets are protected by EALLOW. 1: TripZone registers from 0x34 to 0x35 offsets are locked and not writable" range="1" rwaccess="R/R/WONCE"/> 
		<bitfield id="HRLOCK" width="1" begin="0" end="0" resetval="0x0" description="0: HRPWM registers from 0x20 to 0x2D offsets are protected by EALLOW 1: HRPWM registers from 0x20 and 0x2D offsets are locked and not writable." range="0" rwaccess="R/R/WONCE"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_HWVDELVAL" acronym="CONTROLSS_G3_EPWM14_HWVDELVAL" offset="0x1FA" width="16" description="Hardware Valley Mode Delay Register">
		<bitfield id="HWVDELVAL" width="16" begin="15" end="0" resetval="0x0" description="Hardware Valley Delay Value Register  This read only register reflects the hardware delay value calculated by the equations defined in VCAPCTL[VDELAYDIV]. This reflects the latest value from the hardware calculations and can change every time valley capture sequence is triggered and VCAP1 and VCAP2 values are updated." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_VCNTVAL" acronym="CONTROLSS_G3_EPWM14_VCNTVAL" offset="0x1FC" width="16" description="Hardware Valley Counter Register">
		<bitfield id="VCNTVAL" width="16" begin="15" end="0" resetval="0x0" description="Valley Time Base Counter Register  This register reflects the captured VCNT value upon occurrence of STOPEDGE selected in VCNTCFG register." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM14_XCMPCTL1" acronym="CONTROLSS_G3_EPWM14_XCMPCTL1" offset="0x400" width="32" description="XCMP Mode Control Register">
		<bitfield id="XCMPB_ALLOC" width="4" begin="11" end="8" resetval="0x0" description="XCMPn register allocation for CMPB: - 0 --> Reserved - 1 --> Reserved - 2 --> Reserved - 3 -->  Reserved - 4 -->  Reserved - 5 --> XCMP5 - 6 --> XCMP5, XCMP6 - 7 --> XCMP5, XCMP6, XCMP7 - 8 --> XCMP5, XCMP6, XCMP7, XCMP8 This register settings will take effect only when XCMPEN==1 And XCMPSPLIT ==1" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMPA_ALLOC" width="4" begin="7" end="4" resetval="0x0" description="XCMPn register allocation for CMPA: - 0 --> No XCMP - 1 --> XCMP1 - 2 --> XCMP1, XCMP2 - 3 --> XCMP1, XCMP2, XCMP3 - 4 --> XCMP1, XCMP2, XCMP3, XCMP4 - 5 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5 - 6 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5,                         XCMP6 - 7 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5,         XCMP6, XCMP7 - 8 --> XCMP1, XCMP2, XCMP3, XCMP4, XCMP5,         XCMP6, XCMP7, XCMP8 This register settings will take effect only when XCMPEN==1 If XCMPSPLIT ==1, this field cannot be greater than 4. If XCMPSPLIT ==1 only lower 3 bits are used in this field." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMPSPLIT" width="1" begin="1" end="1" resetval="0x0" description="XCMP Register Allocation Options:  0 : XCMP1-8 --> CMPA 1 : XCMP1-4 -->CMPA, XCMP5-8  CMPB This register settings will take effect only when XCMPEN==1" range="1" rwaccess="R/W"/> 
		<bitfield id="XCMPEN" width="1" begin="0" end="0" resetval="0x0" description="XCMP Compare Register Operation Enable:  0 XCMP register operation Disabled     [operation compatible to Type-4] 1 XCMP register operation Enabled    [New CMPx registers are effective - section 1.3 details the operation]" range="0" rwaccess="R/W"/>
	</register>
